/**
 * Команда, выводящая информацию о доступных командах
 */
package commands;

public class HelpCommand implements NoArgCommand {
    private static final String description = """
                help : вывести справку по доступным командам
                info : вывести в стандартный поток вывода информацию о коллекции (тип, дата инициализации, количество элементов и т.д.)
                show : вывести в стандартный поток вывода все элементы коллекции в строковом представлении
                add {element} : добавить новый элемент в коллекцию
                update_id {element} : обновить значение элемента коллекции, id которого равен заданному
                remove_by_id id : удалить элемент из коллекции по его id
                clear : очистить коллекцию
                save : сохранить коллекцию в файл
                execute_script file_name : считать и исполнить скрипт из указанного файла. В скрипте содержатся команды в таком же виде, в котором их вводит пользователь в интерактивном режиме.
                exit : завершить программу (без сохранения в файл)
                head : вывести первый элемент коллекции
                add_if_min {element} : добавить новый элемент в коллекцию, если его значение меньше, чем у наименьшего элемента этой коллекции
                remove_lower {element} : удалить из коллекции все элементы, меньшие, чем заданный
                sum_of_price : вывести сумму значений поля price для всех элементов коллекции
                filter_greater_than_price price : вывести элементы, значение поля price которых больше заданного
                print_descending : вывести элементы коллекции в порядке убывания
                """;
    @Override
    public void execute() {
        System.out.print(description);
    }
}
